In [1]:
import pandas as pd
import numpy as np
a=np.array([1,2,3,4])
s=pd.Series(a)
s

0    1
1    2
2    3
3    4
dtype: int64

In [2]:
a=[1,3,34,5]
s=pd.Series(a)
s

0     1
1     3
2    34
3     5
dtype: int64

In [3]:
a=[1,3,34,5]
b=["m","e","so","hi"]
s=pd.Series(data=a,index=b)
s

m      1
e      3
so    34
hi     5
dtype: int64

In [9]:
import pandas as pd
df=pd.read_csv("missing.csv")
missing= df.fillna(df["salary"].mean())
missing

   eno   ename  salary  deptno         doj
0  101   Amber  1000.0    10.0  2018-05-14
1  102    Amar  1087.5    10.0  2017-03-22
2  103  1087.5  1200.0    20.0  2019-07-01
3  104   Anita  1100.0  1087.5  2020-01-15
4  105    Ajay  1050.0    30.0      1087.5
5  106  1087.5  1087.5  1087.5      1087.5

In [10]:
import pandas as pd
df=pd.read_csv("missing.csv")
fi=df[df['eno']>104]
fi

   eno ename  salary  deptno  doj
4  105  Ajay  1050.0    30.0  NaN
5  106   NaN     NaN     NaN  NaN

In [12]:
df=pd.read_csv("missing.csv")
fi=df[4:5]
fi

   eno ename  salary  deptno  doj
4  105  Ajay  1050.0    30.0  NaN

In [19]:
df=pd.read_csv("missing.csv")
k=df.loc[[3,4],["eno","ename"]]
k

   eno  ename
3  104  Anita
4  105   Ajay

In [34]:
df=pd.read_csv("missing.csv")
col=df.sort_values(by='salary',ascending=False)
col

   eno  ename  salary  deptno         doj
2  103    NaN  1200.0    20.0  2019-07-01
3  104  Anita  1100.0     NaN  2020-01-15
4  105   Ajay  1050.0    30.0         NaN
0  101  Amber  1000.0    10.0  2018-05-14
1  102   Amar     NaN    10.0  2017-03-22
5  106    NaN     NaN     NaN         NaN